# 1. Программа должна выводить данные
# 2. Программа должна сохранять данные в текстовом файле
# 3. Пользователь может ввести одну из характеристик для поиска определенной
#    записи(Например имя или фамилию человека)
# 4. Использование функций. Ваша программа не должна быть линейной

# 1. Открыть файл.
# 2. Сохранить файл.
# 3. Пoказать телефонную книжку
# 4. Добавить контакт
# 5. Найти контакт.
# 6. Удалить контакт
# 7. Выход


import controller

if __name__ == '__main__':
    controller.start()